; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-7-1)
(:domain sobokosnake)
(:objects
    pos0-1 - location
    pos0-2 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos1-4 - location
    pos1-5 - location
    pos2-1 - location
    pos2-2 - location
    pos2-3 - location
    pos2-4 - location
    pos2-5 - location
    pos3-1 - location
    pos3-2 - location
    pos3-3 - location
    pos3-4 - location
    pos3-5 - location
    pos4-0 - location
    pos4-1 - location
    pos4-2 - location
    pos5-0 - location
    pos5-1 - location
    pos5-2 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-1 pos0-2 dir-right)
    (MOVE-DIR pos0-1 pos1-1 dir-down)
    (MOVE-DIR pos0-2 pos1-2 dir-down)
    (MOVE-DIR pos0-2 pos0-1 dir-left)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-1 pos0-1 dir-up)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos2-2 dir-down)
    (MOVE-DIR pos1-2 pos0-2 dir-up)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-3 pos1-4 dir-right)
    (MOVE-DIR pos1-3 pos2-3 dir-down)
    (MOVE-DIR pos1-4 pos1-3 dir-left)
    (MOVE-DIR pos1-4 pos1-5 dir-right)
    (MOVE-DIR pos1-4 pos2-4 dir-down)
    (MOVE-DIR pos1-5 pos1-4 dir-left)
    (MOVE-DIR pos1-5 pos2-5 dir-down)
    (MOVE-DIR pos2-1 pos2-2 dir-right)
    (MOVE-DIR pos2-1 pos3-1 dir-down)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-2 pos2-1 dir-left)
    (MOVE-DIR pos2-2 pos2-3 dir-right)
    (MOVE-DIR pos2-2 pos3-2 dir-down)
    (MOVE-DIR pos2-2 pos1-2 dir-up)
    (MOVE-DIR pos2-3 pos2-2 dir-left)
    (MOVE-DIR pos2-3 pos2-4 dir-right)
    (MOVE-DIR pos2-3 pos3-3 dir-down)
    (MOVE-DIR pos2-3 pos1-3 dir-up)
    (MOVE-DIR pos2-4 pos2-3 dir-left)
    (MOVE-DIR pos2-4 pos2-5 dir-right)
    (MOVE-DIR pos2-4 pos3-4 dir-down)
    (MOVE-DIR pos2-4 pos1-4 dir-up)
    (MOVE-DIR pos2-5 pos2-4 dir-left)
    (MOVE-DIR pos2-5 pos3-5 dir-down)
    (MOVE-DIR pos2-5 pos1-5 dir-up)
    (MOVE-DIR pos3-1 pos3-2 dir-right)
    (MOVE-DIR pos3-1 pos4-1 dir-down)
    (MOVE-DIR pos3-1 pos2-1 dir-up)
    (MOVE-DIR pos3-2 pos3-1 dir-left)
    (MOVE-DIR pos3-2 pos3-3 dir-right)
    (MOVE-DIR pos3-2 pos4-2 dir-down)
    (MOVE-DIR pos3-2 pos2-2 dir-up)
    (MOVE-DIR pos3-3 pos3-2 dir-left)
    (MOVE-DIR pos3-3 pos3-4 dir-right)
    (MOVE-DIR pos3-3 pos2-3 dir-up)
    (MOVE-DIR pos3-4 pos3-3 dir-left)
    (MOVE-DIR pos3-4 pos3-5 dir-right)
    (MOVE-DIR pos3-4 pos2-4 dir-up)
    (MOVE-DIR pos3-5 pos3-4 dir-left)
    (MOVE-DIR pos3-5 pos2-5 dir-up)
    (MOVE-DIR pos4-0 pos4-1 dir-right)
    (MOVE-DIR pos4-0 pos5-0 dir-down)
    (MOVE-DIR pos4-1 pos4-0 dir-left)
    (MOVE-DIR pos4-1 pos4-2 dir-right)
    (MOVE-DIR pos4-1 pos5-1 dir-down)
    (MOVE-DIR pos4-1 pos3-1 dir-up)
    (MOVE-DIR pos4-2 pos4-1 dir-left)
    (MOVE-DIR pos4-2 pos5-2 dir-down)
    (MOVE-DIR pos4-2 pos3-2 dir-up)
    (MOVE-DIR pos5-0 pos4-0 dir-up)
    (MOVE-DIR pos5-0 pos5-1 dir-right)
    (MOVE-DIR pos5-1 pos5-0 dir-left)
    (MOVE-DIR pos5-1 pos5-2 dir-right)
    (MOVE-DIR pos5-1 pos4-1 dir-up)
    (MOVE-DIR pos5-2 pos5-1 dir-left)
    (MOVE-DIR pos5-2 pos4-2 dir-up)
    (thinsnake pos5-2)
    (blocked pos5-2)
    (ispoint pos2-5)
    (ispoint pos3-1)
    (ispoint pos4-0)
    (isbox pos1-2)
    (isbox pos1-4)
    (isbox pos2-1)
    (isbox pos2-4)
    (isbox pos3-2)
    (isbox pos3-3)
    (isbox pos4-1)
    (isbox pos5-1)
)
(:goal
(and
    (not (ispoint pos2-5))
    (not (ispoint pos3-1))
    (not (ispoint pos4-0))
)
)
)

; plan
1. (move-thin-snake-and-box pos5-2 pos5-1 pos5-0 dir-left)
   deleted: (thinsnake pos5-2) (blocked pos5-2) (isbox pos5-1)
   added: (thinsnake pos5-1) (blocked pos5-1) (isbox pos5-0)
   goals met: 0 of 3
2. (move-thin-snake pos5-1 pos5-2 dir-right)
   deleted: (thinsnake pos5-1) (blocked pos5-1)
   added: (thinsnake pos5-2) (blocked pos5-2)
   goals met: 0 of 3
3. (move-thin-snake pos5-2 pos4-2 dir-up)
   deleted: (thinsnake pos5-2) (blocked pos5-2)
   added: (thinsnake pos4-2) (blocked pos4-2)
   goals met: 0 of 3
4. (move-thin-snake-and-box pos4-2 pos3-2 pos2-2 dir-up)
   deleted: (thinsnake pos4-2) (blocked pos4-2) (isbox pos3-2)
   added: (thinsnake pos3-2) (blocked pos3-2) (isbox pos2-2)
   goals met: 0 of 3
5. (move-thin-snake-and-first-eat pos3-2 pos3-1 dir-left)
   deleted: (ispoint pos3-1) (thinsnake pos3-2)
   added: (blocked pos3-1) (headsnake pos3-1) (tailsnake pos3-2) (nextsnake pos3-1 pos3-2)
   goals met: 1 of 3
6. (move-fat-snake-and-box pos3-1 pos2-1 pos3-2 pos3-1 pos1-1 dir-up)
   deleted: (headsnake pos3-1) (blocked pos3-2) (tailsnake pos3-2) (nextsnake pos3-1 pos3-2) (isbox pos2-1)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos3-1) (tailsnake pos3-1) (isbox pos1-1)
   goals met: 1 of 3
7. (move-fat-snake-and-box pos2-1 pos1-1 pos3-1 pos2-1 pos0-1 dir-up)
   deleted: (headsnake pos2-1) (blocked pos3-1) (tailsnake pos3-1) (nextsnake pos2-1 pos3-1) (isbox pos1-1)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos2-1) (tailsnake pos2-1) (isbox pos0-1)
   goals met: 1 of 3
8. (move-fat-snake-and-box pos1-1 pos1-2 pos2-1 pos1-1 pos1-3 dir-right)
   deleted: (headsnake pos1-1) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos1-1 pos2-1) (isbox pos1-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1) (tailsnake pos1-1) (isbox pos1-3)
   goals met: 1 of 3
9. (move-fat-snake-and-box pos1-2 pos2-2 pos1-1 pos1-2 pos3-2 dir-down)
   deleted: (headsnake pos1-2) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1) (isbox pos2-2)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos1-2) (tailsnake pos1-2) (isbox pos3-2)
   goals met: 1 of 3
10. (move-fat-snake pos2-2 pos2-3 pos1-2 pos2-2 dir-right)
   deleted: (headsnake pos2-2) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos2-2 pos1-2)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos2-2) (tailsnake pos2-2)
   goals met: 1 of 3
11. (move-fat-snake-and-box pos2-3 pos2-4 pos2-2 pos2-3 pos2-5 dir-right)
   deleted: (headsnake pos2-3) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos2-3 pos2-2) (isbox pos2-4)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3) (tailsnake pos2-3) (isbox pos2-5)
   goals met: 1 of 3
12. (move-fat-snake pos2-4 pos3-4 pos2-3 pos2-4 dir-down)
   deleted: (headsnake pos2-4) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-4 pos2-3)
   added: (blocked pos3-4) (headsnake pos3-4) (nextsnake pos3-4 pos2-4) (tailsnake pos2-4)
   goals met: 1 of 3
13. (move-fat-snake pos3-4 pos3-5 pos2-4 pos3-4 dir-right)
   deleted: (headsnake pos3-4) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos3-4 pos2-4)
   added: (blocked pos3-5) (headsnake pos3-5) (nextsnake pos3-5 pos3-4) (tailsnake pos3-4)
   goals met: 1 of 3
14. (move-box-and-eat pos3-5 pos2-5 pos1-5 dir-up)
   deleted: (headsnake pos3-5) (ispoint pos2-5) (isbox pos2-5)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos3-5) (isbox pos1-5)
   goals met: 2 of 3
15. (move-fat-snake pos2-5 pos2-4 pos3-4 pos3-5 dir-left)
   deleted: (headsnake pos2-5) (blocked pos3-4) (tailsnake pos3-4) (nextsnake pos3-5 pos3-4)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-5) (tailsnake pos3-5)
   goals met: 2 of 3
16. (move-fat-snake pos2-4 pos2-3 pos3-5 pos2-5 dir-left)
   deleted: (headsnake pos2-4) (blocked pos3-5) (tailsnake pos3-5) (nextsnake pos2-5 pos3-5)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos2-4) (tailsnake pos2-5)
   goals met: 2 of 3
17. (move-fat-snake pos2-3 pos2-2 pos2-5 pos2-4 dir-left)
   deleted: (headsnake pos2-3) (blocked pos2-5) (tailsnake pos2-5) (nextsnake pos2-4 pos2-5)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos2-3) (tailsnake pos2-4)
   goals met: 2 of 3
18. (move-fat-snake-and-box pos2-2 pos3-2 pos2-4 pos2-3 pos4-2 dir-down)
   deleted: (headsnake pos2-2) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos2-3 pos2-4) (isbox pos3-2)
   added: (blocked pos3-2) (headsnake pos3-2) (nextsnake pos3-2 pos2-2) (tailsnake pos2-3) (isbox pos4-2)
   goals met: 2 of 3
19. (move-fat-snake pos3-2 pos3-1 pos2-3 pos2-2 dir-left)
   deleted: (headsnake pos3-2) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-2 pos2-3)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos3-2) (tailsnake pos2-2)
   goals met: 2 of 3
20. (move-fat-snake-and-box pos3-1 pos4-1 pos2-2 pos3-2 pos5-1 dir-down)
   deleted: (headsnake pos3-1) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos3-2 pos2-2) (isbox pos4-1)
   added: (blocked pos4-1) (headsnake pos4-1) (nextsnake pos4-1 pos3-1) (tailsnake pos3-2) (isbox pos5-1)
   goals met: 2 of 3
21. (move-and-eat pos4-1 pos4-0 dir-left)
   deleted: (headsnake pos4-1) (ispoint pos4-0)
   added: (blocked pos4-0) (headsnake pos4-0) (nextsnake pos4-0 pos4-1)
   goals met: 3 of 3
